app/Models/ModelLokasi.php

INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`) VALUES ('test', '121378651254894', '-0.4750337391726243', '100.76278351593227', '1779343567_0761d44e05935568b073.png')
---
    public function insertData($data)
    {
        $this->db->table('tbl_lokasi')->insert($data);

SELECT *
FROM `tbl_lokasi`
---
    public function allData()
    {
        return $this->db->table('tbl_lokasi')
            ->get()->getResultArray();

SELECT *
FROM `tbl_lokasi`
WHERE `id_lokasi` = '7'
---
    public function getData($id_lokasi)
    {
        return $this->db->table('tbl_lokasi')
            ->where('id_lokasi', $id_lokasi)
            ->get()->getRowArray();

UPDATE `tbl_lokasi` SET `nama_lokasi` = 'udin', `alamat_lokasi` = 'beverly hils', `latitude` = '-0.4749601325636266', `longitude` = '100.7628564131244'
WHERE `id_lokasi` = '7'
---
    public function updateData($data, $id_lokasi)
    {
        $this->db->table('tbl_lokasi')
            ->where('id_lokasi', $id_lokasi)
            ->update($data);

DELETE FROM `tbl_lokasi`
WHERE `id_lokasi` = '7'
---
    public function deleteData($id_lokasi)
    {
        $this->db->table('tbl_lokasi')
            ->where('id_lokasi', $id_lokasi)
            ->delete();